Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: འདུ་ཤེས་ཉིད་ཚོར་བ་ཚོར་བ་ཉིད་འདུ་ཤེས་ཡིན་པས་འདི་ལ་ཤེས་པ་པོ་མེད།
en: A perception is itself a sensation and a sensation is itself a perception. Therefore, there is no one to perceive this, and no one to sense it.’

source: ཚོར་བ་པོ་མེད་དོ་སྙམ་ནས་དེ་ལྟར་མཐོང་བས་རྣམ་པར་འགྲོལ་ཏེ།
en: Observing this, one is liberated.

source: དེའི་ཕྱིར་རྣམ་པར་ཐར་པ་ཞེས་བྱ་སྟེ།
en: That is why it is called a liberation.

source: འདི་དག་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་དོ། །
en: “These are the eight liberations.

source: དེ་ལ་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བརྒྱད་གང་ཞེ་ན།
en: “What then are the eight domains of mastery?

source: གཟུགས་ཅན་གཟུགས་རྣམས་ལ་བལྟ་ཞིང་དེ་དག་ཟིལ་གྱིས་མནན་ནས་ཤེས།
en: (1) An embodied person looks at forms and understands after mastering them, sees after mastering them.

source: ཟིལ་གྱིས་མནན་ནས་མཐོང་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་དང་པོའོ། །
en: This is the first domain of mastery.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་ཁ་དོག་བཟང་པོ་དང་ཁ་དོག་ངན་པ་རྣམས་ལ་བལྟ་ཞིང་དེ་དག་ཟིལ་གྱིས་མནན་ནས་ཤེས།
en: (2) One who perceives formlessness internally looks at external forms with attractive colors and unattractive colors and understands after mastering them, sees after mastering them.

source: ཟིལ་གྱིས་མནན་ནས་མཐོང་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་གཉིས་པའོ། །
en: This is the second domain of mastery.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་ཚད་མེད་པ་དང་ཆེན་པོར་གྱུར་པ་ཁ་དོག་བཟང་པོ་དང་། ཁ་དོག་ངན་པ་རྣམས་ལ་བལྟ་ཞིང་དེ་དག་ཟིལ་གྱིས་མནན་ནས་ཤེས།
en: (3) One who perceives formlessness internally looks at external forms as unquantifiable, as large, as being of an attractive or unattractive color, and understands after mastering them, sees after mastering them.

source: ཟིལ་གྱིས་མནན་ནས་མཐོང་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་གསུམ་པའོ། །
en: This is the third domain of mastery.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་ཆུང་ངུ་། ཁ་དོག་བཟང་པོ་དང་ཁ་དོག་ངན་པ་རྣམས་ལ་བལྟ་ཞིང་དེ་དག་ཟིལ་གྱིས་མནན་ནས་ཤེས།
en: (4) One who perceives formlessness internally looks at diminutive forms with attractive colors and unattractive colors and understands after mastering them, sees after mastering them.

source: ཟིལ་གྱིས་མནན་ནས་མཐོང་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བཞི་པའོ། །
en: This is the fourth domain of mastery.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་སྔོན་པོ། ཁ་དོག་སྔོན་པོ། སྔོན་པོ་ལྟ་བུར་སྟོན་པ། འོད་སྔོན་པོ་འབྱུང་བ་རྣམས་ལ་བལྟ་སྟེ།
en: (5) One who perceives formlessness internally looks at external forms that are blue, the color blue, something that appears to be blue, or gives off blue light.

source: དཔེར་ན་ཟར་མའི་མེ་ཏོག་སྔོན་པོ་ཁ་དོག་སྔོན་པོ། སྔོན་པོ་ལྟ་བུར་སྟོན་པ།
en: This could be, for example, a blue flax blossom, which is blue in color, appears to be blue, and gives off blue light.

source: འོད་སྔོན་པོ་འབྱུང་བ་དེ་བཞིན་དུ་ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་སྔོན་པོ། ཁ་དོག་སྔོན་པོ། སྔོན་པོ་ལྟ་བུར་སྟོན་པ།
en: One who perceives formlessness internally looks at external forms that are blue, the color blue, something that appears to be blue, or gives off blue light.

source: འོད་སྔོན་པོ་འབྱུང་བ་རྣམས་ལ་བལྟ་ཞིང་དེ་དག་ཟིལ་གྱིས་མནན་ནས་ཤེས།
en: They understand after mastering them, see after mastering them.

source: ཟིལ་གྱིས་མནན་ནས་མཐོང་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་ལྔ་པའོ། །
en: This is the fifth domain of mastery.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་སེར་པོ། ཁ་དོག་སེར་པོ། སེར་པོ་ལྟ་བུར་སྟོན་པ། འོད་སེར་པོ་འབྱུང་བ་རྣམས་ལ་བལྟ་སྟེ།
en: (6) One who perceives formlessness internally looks at external forms that are yellow, the color yellow, something that appears to be yellow, or gives off yellow light.

source: དཔེར་ན་དོང་ཀའི་མེ་ཏོག་སེར་པོ། ཁ་དོག་སེར་པོ། སེར་པོ་ལྟ་བུར་སྟོན་པ།
en: This could be, for example, the blossom of the golden shower tree, which is yellow in color, appears to be yellow, and gives off yellow light.

source: འོད་སེར་པོ་འབྱུང་བ་དེ་བཞིན་དུ་ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་སེར་པོ། ཁ་དོག་སེར་པོ། སེར་པོ་ལྟ་བུར་སྟོན་པ།
en: One who perceives formlessness internally looks at external forms that are yellow, the color yellow, something that appears to be yellow, or gives off yellow light.

source: འོད་སེར་པོ་འབྱུང་བ་རྣམས་ལ་བལྟ་ཞིང་དེ་དག་ཟིལ་གྱིས་མནན་ནས་ཤེས།
en: They understand after mastering them, see after mastering them.

source: ཟིལ་གྱིས་མནན་ནས་མཐོང་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་དྲུག་པའོ། །
en: This is the sixth domain of mastery.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་དམར་པོ། ཁ་དོག་དམར་པོ། དམར་པོ་ལྟ་བུར་སྟོན་པ། འོད་དམར་པོ་འབྱུང་བ་རྣམས་ལ་བལྟ་སྟེ།
en: (7) One who perceives formlessness internally looks at external forms that are red, the color red, something that appears to be red, or gives off red light.

source: དཔེར་ན་བན་དུ་ཛི་བ་ཀའི་མེ་ཏོག་དམར་པོ། ཁ་དོག་དམར་པོ། དམར་པོ་ལྟ་བུར་སྟོན་པ།
en: This could be, for example, a noon flower blossom, which is red in color, appears to be red, and gives off red light.

source: འོད་དམར་པོ་འབྱུང་བ་དེ་བཞིན་དུ་ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་དམར་པོ། ཁ་དོག་དམར་པོ། དམར་པོ་ལྟ་བུར་སྟོན་པ།
en: One who perceives formlessness internally looks at external forms that are red, the color red, something that appears to be red, or gives off red light.

source: འོད་དམར་པོ་འབྱུང་བ་རྣམས་ལ་བལྟ་ཞིང་དེ་དག་ཟིལ་གྱིས་མནན་ནས་ཤེས།
en: They understand after mastering them, see after mastering them.

source: ཟིལ་གྱིས་མནན་ནས་མཐོང་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བདུན་པའོ། །
en: This is the seventh domain of mastery.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་དཀར་པོ། ཁ་དོག་དཀར་པོ། དཀར་པོ་ལྟ་བུར་སྟོན་པ། འོད་དཀར་པོ་འབྱུང་བ་རྣམས་ལ་བལྟ་སྟེ།
en: (8) One who perceives formlessness internally looks at external forms that are white, the color white, something that appears to be white, or gives off white light.

source: དཔེར་ན་སྐར་མ་པ་བ་སངས་དཀར་པོ། ཁ་དོག་དཀར་པོ། དཀར་པོ་ལྟ་བུར་སྟོན་པ།
en: This could be, for example, the Venus-star blossom, which is white in color, appears to be white, and gives off white light.

source: འོད་དཀར་པོ་འབྱུང་བ་དེ་བཞིན་དུ་ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་དཀར་པོ། ཁ་དོག་དཀར་པོ། དཀར་པོ་ལྟ་བུར་སྟོན་པ།
en: One who perceives formlessness internally looks at external forms that are white, the color white, something that appears to be white, or gives off white light.

source: འོད་དཀར་པོ་འབྱུང་བ་རྣམས་ལ་བལྟ་ཞིང་དེ་དག་ཟིལ་གྱིས་མནན་ནས་ཤེས།
en: They understand after mastering them, see after mastering them.

source: ཟིལ་གྱིས་མནན་ནས་མཐོང་བ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བརྒྱད་པའོ། །
en: This is the eighth domain of mastery.

source: དེ་ལ་ཟད་པར་གྱི་སྐྱེ་མཆེད་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཟད་པར་ས་དང་།
en: “What are the ten objects of meditative immersion?

source: ཟད་པར་ཆུ་དང་། ཟད་པར་མེ་དང་། ཟད་པར་རླུང་དང་། ཟད་པར་ནམ་མཁའ་དང་། ཟད་པར་སྔོན་པོ་དང་། ཟད་པར་སེར་པོ་དང་།
en: They are earth, water, fire, wind, space, blue, yellow, red, white, and consciousness.

source: ཟད་པར་དམར་པོ་དང་། ཟད་པར་དཀར་པོ་དང་། ཟད་པར་རྣམ་པར་ཤེས་པ་སྟེ། འདི་དག་ནི་ཟད་པར་གྱི་སྐྱེ་མཆེད་བཅུའོ། །
en: These are the ten objects of meditative immersion.

source: ཁམས་ཐམས་ཅད་སའི་ཁམས་སུ་མོས་ན་ཡང་ཐམས་ཅད་ཁམས་གཅིག་ཏུ་འདི་ལྟ་སྟེ། སའི་ཁམས་ཉིད་དུ་འགྱུར་རོ། །
en: “If bodhisattvas have the conviction that all elements are the earth element, they all become a single element; they become the earth element itself.

source: ཐམས་ཅད་ཆུའི་ཁམས་སུ་མོས་ན་ཡང་ཐམས་ཅད་ཁམས་གཅིག་ཏུ་འདི་ལྟ་སྟེ། ཆུའི་ཁམས་ཉིད་དུ་འགྱུར་རོ། །
en: If they have the conviction that all elements are the water element, they all become a single element; they become the water element itself.

source: ཐམས་ཅད་མེའི་ཁམས་སུ་མོས་ན་ཡང་ཐམས་ཅད་ཁམས་གཅིག་ཏུ་འདི་ལྟ་སྟེ། མེའི་ཁམས་ཉིད་དུ་འགྱུར་རོ། །
en: If they have the conviction that all elements are the fire element, they all become a single element; they become the fire element itself.

source: ཐམས་ཅད་རླུང་གི་ཁམས་སུ་མོས་ན་ཡང་ཐམས་ཅད་ཁམས་གཅིག་ཏུ་འདི་ལྟ་སྟེ། རླུང་གི་ཁམས་ཉིད་དུ་འགྱུར་རོ། །
en: If they have the conviction that all elements are the air element, they all become a single element; they become the air element itself.

source: ཐམས་ཅད་ནམ་མཁའི་ཁམས་སུ་མོས་ན་ཡང་ཐམས་ཅད་ཁམས་གཅིག་ཏུ་འདི་ལྟ་སྟེ། ནམ་མཁའི་ཁམས་ཉིད་དུ་འགྱུར་རོ། །
en: If they have the conviction that all elements are the space element, they all become a single element; they become the space element itself.

source: ཐམས་ཅད་སྔོན་པོར་མོས་ན་ཡང་ཐམས་ཅད་སྔོན་པོ་ཉིད་དུ་འགྱུར་རོ། །
en: If they have the conviction everything is blue, then everything becomes blueness.

source: ཐམས་ཅད་སེར་པོར་མོས་ན་ཡང་ཐམས་ཅད་སེར་པོ་ཉིད་དུ་འགྱུར་རོ། །
en: If they have the conviction everything is yellow, then everything becomes yellowness.

source: ཐམས་ཅད་དམར་པོར་མོས་ན་ཡང་ཐམས་ཅད་དམར་པོ་ཉིད་དུ་འགྱུར་རོ། །
en: If they have the conviction everything is red, then everything becomes redness.

source: ཐམས་ཅད་དཀར་པོར་མོས་ན་ཡང་ཐམས་ཅད་དཀར་པོ་ཉིད་དུ་འགྱུར་རོ། །
en: If they have the conviction everything is white, then everything becomes whiteness.

source: ཐམས་ཅད་རྣམ་པར་ཤེས་པར་མོས་ན་ཡང་ས་དང་། ཆུ་དང་། མེ་དང་། རླུང་དང་། ནམ་མཁའ་དང་། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་ཐམས་ཅད་རྣམ་པར་ཤེས་པ་ཉིད་དུ་འགྱུར་ཏེ།
en: If they have the conviction everything is consciousness, then everything—earth, water, fire, air, space, blue, yellow, red, and white—becomes consciousness itself.

source: དེའི་ཕྱིར་ཟད་པར་གྱི་སྐྱེ་མཆེད་ཅེས་བྱའོ། །
en: For this reason, these are called objects of meditative immersion.

source: ཟད་པར་གྱི་སྐྱེ་བ་འཕེལ་བར་བྱེད་པས་དེའི་ཕྱིར་ཟད་པར་གྱི་སྐྱེ་མཆེད་ཅེས་བྱའོ། །
en: Because they increase the development of immersion, they are called objects of meditative immersion.

source: རེ་རེ་ཡང་སྐྱེ་མཆེད་ཐམས་ཅད་དུ་འགྱུར་བས་དེའི་ཕྱིར་ཟད་པར་གྱི་སྐྱེ་མཆེད་ཅེས་བྱའོ།། །།བམ་པོ་གསུམ་པ།
en: Because each of them can become all of the objects, they are called objects of meditative immersion.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དབང་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཚེ་ལ་དབང་བ་དང་། སེམས་ལ་དབང་བ་དང་། ཡོ་བྱད་ལ་དབང་བ་དང་།
en: “What are the ten powers of a bodhisattva?

source: ལས་ལ་དབང་བ་དང་། སྐྱེ་བ་ལ་དབང་བ་དང་། རྫུ་འཕྲུལ་ལ་དབང་བ་དང་། མོས་པ་ལ་དབང་བ་དང་། སྨོན་ལམ་ལ་དབང་བ་དང་།
en: Power over life, power over the mind, power over possessions, power over karma, power over birth, the power of miraculous emanations, the power of conviction, the power of aspiration, the power of wisdom, and the power of Dharma.

source: ཡེ་ཤེས་ལ་དབང་བ་དང་། ཆོས་ལ་དབང་བ་སྟེ། དེ་དག་ནི་དབང་བཅུའོ། །
en: These are the ten powers.

source: དེ་ལ་བདུད་རྩི་ཐོབ་པའི་ཕྱིར་ཚེ་ལ་དབང་བའོ། །
en: “Because bodhisattvas have obtained amrita, they have power over life.

source: སེམས་ཙམ་དུ་ཡོངས་སུ་ཤེས་པའི་ཕྱིར་སེམས་ལ་དབང་བའོ། །
en: Because they recognize that everything is mind alone, they have power over the mind.

source: ལག་ན་རིན་པོ་ཆེ་དང་ནམ་མཁའི་མཛོད་རབ་ཏུ་རྙེད་པའི་ཕྱིར་ཡོ་བྱད་ལ་དབང་བའོ། །
en: Because they have discovered the jewel-in-hand and the sky treasury, they have power over possessions.

source: བག་ཆགས་དང་བཅས་པའི་ལས་ཀྱི་ལམ་ཀུན་ཆད་པའི་ཕྱིར་ལས་ལ་དབང་བའོ། །
en: Because they have eliminated all paths of karma along with their habitual patterns, they have power over karma.

source: ཏིང་ངེ་འཛིན་རྣམ་པར་བཟློག་པའི་བསམ་གཏན་རྙེད་པའི་ཕྱིར་སྐྱེ་བ་ལ་དབང་བའོ། །
en: By discovering the meditative stability to return from samādhi, they have power over birth.

source: ལྷུན་གྱིས་གྲུབ་པར་བྱ་བ་ལ་འཇུག་པ་ཐོབ་པའི་ཕྱིར་རྫུ་འཕྲུལ་ལ་དབང་བའོ། །
en: Because they have attained the capacity to act effortlessly, they have the power of miraculous emanations.

source: ཟད་པར་གྱི་སྐྱེ་མཆེད་ཐོབ་པར་བྱ་བའི་ཕྱིར་མོས་པ་ལ་དབང་བའོ། །
en: Because they have attained the objects of meditative immersion, they have the power of conviction.

source: བསམས་པ་ཙམ་གྱིས་དོན་ཐོབ་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་ལ་དབང་བའོ། །
en: Because they can achieve their goals by thought alone, they have the power of aspiration.

source: ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཐོབ་པའི་ཕྱིར་ཡེ་ཤེས་ལ་དབང་བའོ། །
en: Because their actions of body, speech, and mind are preceded by wisdom, they have the power of wisdom.

source: དེ་བཞིན་ཉིད་དང་ཆོས་ཀྱི་དབྱིངས་དང་། ཡང་དག་པའི་མཐའ་མཉམ་པའི་ཡེ་ཤེས་དྲི་མ་མེད་པའི་ཕྱིར་ཆོས་ལ་དབང་བའོ། །
en: Because of their stainless wisdom in which suchness, the expanse of phenomena, and the limit of reality are equal, they have the power of Dharma.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་འཇིག་རྟེན་ནི་འཆི་བས་འཇིགས་སྐྲག་སྟེ། དེའི་གཉེན་པོར་ཚེ་ལ་དབང་བའོ། །
en: “Furthermore, child of good family, worldly people are terrified of death; the antidote is the power over life.

source: འཇིག་རྟེན་ནི་སེམས་ཀུན་ནས་ཉོན་མོངས་པས་འཇིགས་སྐྲག་སྟེ། དེའི་གཉེན་པོར་སེམས་ལ་དབང་བའོ། །
en: Worldly people are terrified by the defilements of the mind; the antidote is power over the mind.

source: འཇིག་རྟེན་ནི་ཡོ་བྱད་ཀྱིས་འཇིགས་སྐྲག་སྟེ། དེའི་གཉེན་པོར་ཡོ་བྱད་ལ་དབང་བའོ། །
en: Worldly people are terrified by possessions; the antidote is the power over possessions.

source: འཇིག་རྟེན་ནི་ཉེས་པར་སྤྱོད་པས་འཇིགས་སྐྲག་སྟེ། དེའི་གཉེན་པོར་ལས་ལ་དབང་བའོ། །
en: Worldly people are terrified by bad conduct; the antidote is the power over karma.

source: འཇིག་རྟེན་ནི་ངན་འགྲོས་འཇིགས་སྐྲག་སྟེ། དེའི་གཉེན་པོར་སྐྱེ་བ་ལ་དབང་བའོ། །
en: Worldly people are terrified of the lower states; the antidote is the power over birth.

source: འཇིག་རྟེན་ནི་ཀུན་ནས་ཚོལ་བའི་ཕོངས་པས་འཇིགས་སྐྲག་སྟེ། དེའི་གཉེན་པོར་རྫུ་འཕྲུལ་ལ་དབང་བའོ། །
en: Worldly people are terrified of losing inspiration; the antidote is the power of miraculous emanations.

source: འཇིག་རྟེན་ནི་དམ་པའི་ཆོས་ཀྱིས་ཕོངས་པར་འགྱུར་བའི་ལས་ཀྱིས་འཇིགས་སྐྲག་སྟེ། དེའི་གཉེན་པོར་མོས་པ་ལ་དབང་བའོ། །
en: Worldly people are terrified of having the karma to be excluded from the sublime Dharma; the antidote is the power of conviction.

source: འཇིག་རྟེན་ནི་འདོད་པའི་འཆིང་བས་འཇིགས་སྐྲག་སྟེ། དེའི་གཉེན་པོར་སྨོན་ལམ་ལ་དབང་བའོ། །
en: Worldly people are terrified by the bondage of desire; the antidote is the power of aspiration.

source: འཇིག་རྟེན་ནི་ཐེ་ཚོམ་གྱི་ཟུག་རྔུས་འཇིགས་སྐྲག་སྟེ། དེའི་གཉེན་པོར་ཡེ་ཤེས་ལ་དབང་བའོ། །
en: Worldly people are terrified by the thorn of doubt; the antidote is the power of wisdom.

source: འཇིག་རྟེན་ནི་འཁོར་གྱི་ནང་ན་བག་ཚ་བས་འཇིགས་སྐྲག་སྟེ། དེའི་གཉེན་པོར་ཆོས་ལ་དབང་བའོ། །
en: Worldly people are terrified by the anxieties inherent in saṃsāra; the antidote is the power of Dharma.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་སྲོག་གཅོད་པ་སྤངས་ཤིང་སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བའི་སེམས་མེད་པ་ནི་ཚེ་ལ་དབང་བ་ཐོབ་པར་བྱ་བའི་རྒྱུའོ། །
en: “Furthermore, child of good family, giving up killing and not having a mind that harbors anger toward any being is the cause of attaining the power over life.

source: བདེ་བ་རྣམས་ལ་སྒྲིབ་པ་མེད་པའི་བྱམས་པ་ཆེན་པོ་དང་། སྡུག་བསྔལ་བ་རྣམས་ལ་སྒྲིབ་པ་མེད་པའི་སྙིང་རྗེ་ཆེན་པོ་ནི་སེམས་ལ་དབང་བ་ཐོབ་པར་བྱ་བའི་རྒྱུའོ། །
en: Feeling great unobscured love for those who are happy and great unobscured compassion for those who suffer are the causes for attaining power over the mind.

source: སེམས་སྙོམས་ཤིང་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོད་པ་བྱང་ཆུབ་ཏུ་བསྔོ་བ་ནི་ཡོ་བྱད་ལ་དབང་བ་ཐོབ་པར་བྱ་བའི་རྒྱུའོ། །
en: Equanimity of mind and dedicating one’s relinquishment of all objects to the pursuit of awakening is the cause of attaining power over possessions.

source: ལས་དང་བྱ་བ་ལ་ཞུགས་ནས་ལུས་དང་ངག་དང་ཡིད་ཡོངས་སུ་དག་པའི་ལས་ཀྱིས་ལས་ཀྱི་བྱ་བ་ལས་བདག་གིར་བྱ་བ་ལ་འཇུག་པར་སྟོན་པ་ནི་ལས་ལ་དབང་བ་ཐོབ་པར་བྱ་བའི་རྒྱུའོ། །
en: Once involved with karma and activity, to act karmically through actions that are pure in body, speech, and mind, to display engagement in actions that have personal repercussions, is the cause of attaining the power over karma.

source: བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་ཡང་དག་པར་བསྡུས་པའི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ནི་སྐྱེ་བ་ལ་དབང་བ་ཐོབ་པར་བྱ་བའི་རྒྱུའོ། །
en: The path of the ten virtuous actions coordinated with the mind set on awakening is the cause of attaining the power over birth.

source: རྙེད་པ་དང་བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ཐམས་ཅད་སྦྱིན་པ་དང་། བཞོན་པ་སྦྱིན་པ་ནི་རྫུ་འཕྲུལ་ལ་དབང་བ་ཐོབ་པར་བྱ་བའི་རྒྱུའོ། །
en: Giving away gain, respect, and praise, and giving away means of transportation, are the causes of attaining the power of miraculous emanation.

source: སེམས་ཅན་ཐམས་ཅད་དཀོན་མཆོག་གསུམ་ལ་འགོད་ཅིང་འཛུད་དེ་མོས་པར་བྱེད་པ་ནི་མོས་པ་ལ་དབང་བ་ཐོབ་པར་བྱ་བའི་རྒྱུའོ། །
en: Orienting all beings toward and guiding them to the Three Jewels, and giving them conviction, is the cause of attaining the power of conviction.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དང་ངག་དང་། ཡིད་ཡོངས་སུ་དག་པར་སྒྲུབ་པ་ནི་སྨོན་ལམ་ལ་དབང་བ་ཐོབ་པར་བྱ་བའི་རྒྱུའོ། །
en: Bringing about the purity of all beings’ body, speech, and mind is the cause of attaining the power of aspiration.

source: ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་ཆོས་སྦྱིན་པ་ནི་ཡེ་ཤེས་ལ་དབང་བ་ཐོབ་པར་བྱ་བའི་རྒྱུའོ། །
en: Giving the Dharma with a mind free from interest in material things is the cause of attaining the power of wisdom.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱེད་པ་དང་། ཆོས་མཚུངས་པར་སྟོན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་ཆོས་ཀྱི་སྐུ་སྟེ། ཟང་ཟིང་གི་སྐུ་མ་ཡིན་ནོ་ཞེས་ཡོངས་སུ་འབྱེད་པ་ནི་ཆོས་ལ་དབང་བ་ཐོབ་པར་བྱ་བའི་རྒྱུའོ། །
en: Causing all beings to understand the equality of phenomena, teaching in accord with the Dharma, and making the distinction that ‘the body of the Thus-Gone One is the dharmakāya, not the material body’ are the causes of attaining the power of Dharma.

source: རིགས་ཀྱི་བུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དབང་བཅུའོ། །
en: Child of good family, these are the ten powers of a bodhisattva.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདེན་པ་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཀུན་རྫོབ་ཀྱི་བདེན་པ་དང་། དོན་དམ་པའི་བདེན་པ་དང་། མཚན་ཉིད་ཀྱི་བདེན་པ་དང་། རྣམ་པར་དབྱེ་བའི་བདེན་པ་དང་། ཕྱེ་སྟེ་རྟོག་པའི་བདེན་པ་དང་།
en: “What then are the ten truths of a bodhisattva?

source: དངོས་པོའི་བདེན་པ་དང་། ནུས་པའི་བདེན་པ་དང་། ཟད་པ་དང་མི་སྐྱེ་བ་ཤེས་པའི་བདེན་པ་དང་། ལམ་ལ་འཇུག་པ་ཤེས་པའི་བདེན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀུན་འབྱུང་བའི་བདེན་པ་སྟེ།
en: Conventional truth, ultimate truth, the truth of characteristics, the truth of classification, the truth of discernment, the truth of entities, the truth of capacity, the truth of knowing exhaustion and nonarising, the truth of knowing the entry point to the path, and the truth of the source of all of the wisdom of the thus-gone-ones.

source: འདི་དག་ནི་བདེན་པ་བཅུའོ། །
en: These are the ten truths.

source: དེ་ལ་ཀུན་རྫོབ་ཀྱི་བདེན་པ་ནི་ཚད་དང་འབྲེལ་བ།
en: “Conventional truth involves assessment; it is the delimitation of an object, a conventional designation.

source: ཡུལ་ཡོངས་སུ་ཆད་པ་ཀུན་དུ་ཐ་སྙད་གདགས་པའི་ཕྱིར་གཞན་གྱི་རྐྱེན་གྱི་དབང་གིས་སྟོན་པ། ཆུང་བ་རྒྱ་ཆེན་པོ་མ་ཡིན་པ་སྟེ།
en: As such, an object is indicated by means of factors external to it, such as ‘small’ being defined as ‘not large.’

source: འདི་ནི་ཀུན་རྫོབ་ཀྱི་བདེན་པའོ། །
en: This is conventional truth.

source: དེ་ལ་དོན་དམ་པའི་བདེན་པ་ནི་ཟབ་པ། སྟོང་པ་ཉིད་དང་རབ་ཏུ་ལྡན་པ། ཡུལ་ཡོངས་སུ་མ་ཆད་པ། གཞན་གྱི་རྐྱེན་གྱིས་མ་ཡིན་པ།
en: “Ultimate truth is profound, is consistent with emptiness, does not delimit objects, and is not dependent on external factors.

source: མཉམ་པ་དང་མི་མཉམ་པ་མེད་པ། མ་འཁྲུགས་པ། རྩོད་པ་མེད་པའི་མཚན་ཉིད་དང་ཆོས་ཐམས་ཅད་དེ་བཞིན་ཉིད་ཀྱི་མཚན་ཉིད་དེ།
en: It is neither equivalent nor not equivalent to anything, and it is undisturbed, indisputable, and is the suchness of all phenomena.

source: འདི་ནི་དོན་དམ་པའི་བདེན་པའོ། །
en: This is ultimate truth. “The truth of characteristics is understood as follows.

source: དེ་ལ་མཚན་ཉིད་ཀྱི་བདེན་པ་ནི་གནོད་པའི་མཚན་ཉིད་ནི་སྡུག་བསྔལ་བ། རབ་ཏུ་སྐྱེ་བའི་མཚན་ཉིད་ནི་ཀུན་འབྱུང་བ། ཞི་བའི་མཚན་ཉིད་ནི་འགོག་པ། ངེས་པར་འབྱིན་པའི་མཚན་ཉིད་ནི་ལམ་སྟེ།
en: Its characteristic of being harmful is the truth of suffering, its characteristic of arising is the truth of origin, its characteristic of peace is the truth of cessation, and its characteristic of emergence is the truth of the path.

source: འདི་ནི་མཚན་ཉིད་ཀྱི་བདེན་པ་ཞེས་བྱའོ། །
en: This is what is known as the truth of characteristics.

source: གཞན་ཡང་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་བདག་མེད་པའི་མཚན་ཉིད་དུ་ཤེས་ནས་ངེས་པར་གྱུར་པ་ལ་འཇུག་སྟེ།
en: Furthermore, knowing the natural selflessness of all phenomena, a bodhisattva finds certainty.

source: མཚན་ཉིད་ལས་གྱུར་པའི་ངེས་པར་གྱུར་པ་ནི་མཚན་ཉིད་ཀྱི་བདེན་པ་ཞེས་བྱའོ། །
en: This certainty in the mode of characteristics is known as the truth of characteristics.

source: དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཞི་བའི་མཚན་ཉིད་དང་། རང་བཞིན་གྱིས་དབེན་པའི་མཚན་ཉིད་དང་། རང་བཞིན་གྱིས་སྟོང་པའི་མཚན་ཉིད་དང་། རང་བཞིན་གྱིས་མི་སྐྱེ་མི་འགག་པའི་མཚན་ཉིད་དུ་ཤེས་ནས་ངེས་པར་གྱུར་པ་ལ་འཇུག་སྟེ།
en: Likewise, upon knowing that all phenomena have the characteristic of natural peace, natural isolation, natural emptiness, and that they do not naturally arise or cease, a bodhisattva finds certainty.

source: དེ་ལ་རྣམ་པར་དབྱེ་བའི་མཚན་ཉིད་ནི་ཆོས་ཐམས་ཅད་མཚན་ཉིད་གཅིག་པ་ལས་གཞན་གྱི་དབང་གིས་རྣམ་པར་ཕྱེ་སྟེ་བསྟན་པའོ། །
en: “The characteristic of classification is to classify all phenomena that have a single characteristic in terms of other characteristics and then to explain them as such.

source: མཚན་ཉིད་གཅིག་ཅེས་བྱ་བ་ནི་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་དེ།
en: The single characteristic is the characteristic of emptiness.

source: དེ་ལྟར་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ། སྨོན་པ་མེད་པ། མངོན་པར་འདུ་མི་བྱེད་པ། མ་སྐྱེས་པ་མ་བྱུང་བ།
en: Thus, phenomena that are termed emptiness,signlessness, wishlessness, uncontrived, unarisen, and unceasing are all classifications of emptiness.

source: མ་འགགས་པ་འདི་ནི་སྟོང་པ་ཉིད་དེའི་རྣམ་པར་དབྱེ་བ་སྟེ། རྣམ་པར་དབྱེ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་དོ། །
en: All those classifications have the characteristic of emptiness.

source: དེ་ལྟར་སྟོང་པ་ཉིད་ལ་སླུ་བར་མི་བྱེད་པ་དེའི་ཕྱིར་རྣམ་པར་དབྱེ་བའི་བདེན་པ་ཞེས་བྱ་སྟེ། འདི་ནི་རྣམ་པར་དབྱེ་བའི་བདེན་པ་ཞེས་བྱའོ། །
en: This is therefore known as the truth of classification because those classifications do not contradict emptiness.

source: དེ་ལ་ཕྱེ་སྟེ་རྟོག་པའི་བདེན་པ་གང་ཞེ་ན།
en: “What is the truth of discernment?

source: ཕྲལ་ནས་རྟོག་པ་ནི་ཕྱེ་སྟེ་རྟོག་པ་སྟེ།
en: Discernment is to understand through exclusion.

source: ངེས་པར་སེམས་པ། རིག་པ་མཐོང་བ། ཁོང་དུ་ཆུད་པ། མངོན་པར་རྟོགས་པ། ཤེས་པ་ཞེས་བྱ་ལ་མི་སླུ་བ་སྟེ།
en: It is affirming, and so can be called mental conviction, informed seeing, understanding, realization, and knowing.

source: དེའི་ཕྱིར་ཕྱེ་སྟེ་རྟོག་པའི་བདེན་པ་ཞེས་བྱའོ། །
en: For this reason, it is known as the truth of discernment.

source: དེ་ལ་དངོས་པོའི་བདེན་པ་ནི་དངོས་པོ་ཤེས་པ་སྟེ།
en: “The truth of entities refers to the knowledge of entities.

source: དངོས་པོ་དེ་དག་ནི་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་སོ། །
en: The entities are the aggregates, elements, and sense bases.

source: ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་དེ་དག་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། སྟོང་པ་དང་དངོས་པོ་མེད་པར་ཤེས་པ་སྟེ།
en: The aggregates, elements, and sense bases are known to be dependently arisen, empty, and insubstantial.

source: དེ་ལྟར་ཤེས་ནས་ངེས་པར་གྱུར་པ་ལ་འཇུག་པས་དེའི་ཕྱིར་དངོས་པོའི་བདེན་པ་ཞེས་བྱའོ། །
en: Knowing this, a bodhisattva reaches certainty. For this reason, it is known as the truth of entities.

source: དེ་ལ་ནུས་པའི་བདེན་པ་ནི་ཡེ་ཤེས་དེ་དང་། སྤོང་བ་དེ་དང་ལམ་དེས་ཉོན་མོངས་པ་སྤོང་བར་བྱེད་པ་དང་། སྟོབས་དང་མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཁོང་དུ་ཆུད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དབང་པོ་ཉིད་ཁོང་དུ་ཆུད་པར་ནུས་པ་སྟེ།
en: “The truth of capacity refers to the capacity to instigate the abandonment of the afflictive emotions through wisdom, abandonment, and the path; it the capacity to understand the strengths, fearlessnesses, and unique qualities of a buddha; and it is the capacity to understand the abilities of the thus-gone ones.

source: དེའི་ཕྱིར་ནུས་པའི་བདེན་པ་ཞེས་བྱའོ། །
en: For this reason, it is known as the truth of capacity.

source: དེ་ལ་ཟད་པ་དང་མི་སྐྱེ་བ་ཤེས་པའི་བདེན་པ་ནི་འདུས་བྱས་ཐམས་ཅད་ཟད་པ་ཅན་དུ་སྟོན་ཏེ།
en: “The truth of knowing exhaustion and nonarising demonstrates that all compounded things will be exhausted.

source: ཟད་པ་དེ་ཡང་མི་ཟད་ལ་ཟད་པ་ལ་ཟད་པ་མེད་དོ། །
en: That exhaustion, however, is not exhausted, as exhaustion does not exist for exhaustion.

source: གལ་ཏེ་ཟད་པ་ལ་ཟད་པ་ཡོད་དུ་ཟིན་ན་འགོག་པ་ཡང་ཟད་པར་འགྱུར་ཏེ།
en: If exhaustion were to exist for exhaustion, cessation would be exhausted as well.
